{
	"slots": [
		{
			"from": "08:30",
			"to": "09:30",
			"sessions": [
				{
					"title": "Anmeldung"
				}
			]
		},
		{
			"from": "09:15",
			"to": "09:30",
			"sessions": [
				{
					"title": "Begrüßung",
					"lang": "de",
					"speaker": "GDG Karlsruhe",
					"room": "Audimax"
				}
			]
		},
		{
			"from": "09:30",
			"to": "10:15",
			"sessions": [
				{
					"title": "Why do we need more Nerds? (Keynote)",
					"lang": "de",
					"speaker": "Dominik Helleberg",
					"speakerlink": "https://plus.google.com/+DominikHelleberg",
					"abstract": "Keynote",
					"room": "Audimax"
				}
			]
		},
		{
			"from": "10:15",
			"to": "10:45",
			"sessions": [
				{
					"title": "Kaffeepause"
				}
			]
		},
		{
			"from": "10:45",
			"to": "11:30",
			"sessions": [
				{
					"title": "To be announced",
					"speaker": "",
					"speakerlink": "",
					"abstract": "TBD",
					"room": "Audimax"
				},
				{
					"title": "Effizientere Softwareentwicklung durch den Einsatz von Google Guava",
					"lang": "de",
					"speaker": "Peter Fichtner",
					"speakerlink": "https://www.xing.com/profile/Peter_Fichtner",
					"abstract": "Google Guava hat sich in der Java-Welt über die letzten Jahre von einer Bibliothek rund um das Thema Collections (ursprünglich noch unter dem Namen \"Google Collections\") zu einer vielseitigen Bibliothek entwickelt, die Java Entwickler über weite Bereiche bei ihrer täglichen Arbeit unterstützt. Neben dem Bereitstellen von funktionalen Ansätzen, auch ohne Java 8, bietet Guava eine breite Auswahl an Klassen um die Effizienz in der Java-Entwicklung zu steigern, was zu schlankerem Code und somit zu einer besseren Lesbarkeit und Wartbarkeit führt.",
					"room": "A266"
				},
				{
					"title": "How we use AppEngine @ CrowdAppz",
					"lang": "de",
					"speaker": "CrowdAppz",
					"speakerlink": "http://www.crowdappz.com",
					"abstract": "We would like to present how to use Google Appengine in combination with Google Cloud Storage and Datastore to develop a scalable backend for mobile applications. As a use case we will present our app Drop which utilizes these technologies.",
					"room": "A268"
				}
			]
		},

		{
			"from": "11:30",
			"to": "12:15",
			"sessions": [
				{
					"title": "Mobile Cross-Platform Game Development",
					"lang": "de",
					"speaker": ["Tim Reiter", "Daniel Reichert", "Alisa Jung" ],
					"speakerlink": "https://plus.google.com/103180493488525231357/posts",
					"abstract": "We start off by telling you about our experiences with mobile games, the benefits of cross-platform development and an overview of current mobile game engines / frameworks with their pros and cons. In the second half we will code a small game with the Unity engine and the Cocos2d-x framework that you will be able to run on Android and other platforms.",
					"room": "Audimax"
				},
				{
					"title": "Effizientere Softwareentwicklung durch den Einsatz von Google Guava",
					"lang": "de",
					"speaker": "Peter Fichtner",
					"speakerlink": "https://www.xing.com/profile/Peter_Fichtner",
					"abstract": "Google Guava hat sich in der Java-Welt über die letzten Jahre von einer Bibliothek rund um das Thema Collections (ursprünglich noch unter dem Namen \"Google Collections\") zu einer vielseitigen Bibliothek entwickelt, die Java Entwickler über weite Bereiche bei ihrer täglichen Arbeit unterstützt. Neben dem Bereitstellen von funktionalen Ansätzen, auch ohne Java 8, bietet Guava eine breite Auswahl an Klassen um die Effizienz in der Java-Entwicklung zu steigern, was zu schlankerem Code und somit zu einer besseren Lesbarkeit und Wartbarkeit führt.",
					"room": "A266"
				},
				{
					"title": "Fortgeschrittene GWT Best Practices",
					"lang": "de",
					"speaker": ["Ralf Klemmer", "Dr. André Janus"],
					"speakerlink": "http://www.codecamp-gbr.de/",
					"abstract": "Der Vortrag besteht aus zwei Teilen: Im 1. Teil werden die verschiedenen Methoden zur Client-Server-Kommunikation in GWT sowie deren Vor- und Nachteile in verschiedenen Einsatz-Szenarien dargestellt. Der 2. Teil befasst sich mit Continuous Integration und Continuous Delivery im GWT-Umfeld sowie deren Umsetzung mit Ant und Jenkins.",
					"room": "A268"
				}
			]
		},
		{
			"from": "12:15",
			"to": "13:15",
			"sessions": [
				{
					"title": "Mittagspause"
				}
			]
		},
		{
			"from": "13:15",
			"to": "14:00",
			"sessions": [
				{
					"title": "Clean Unit Test Patterns",
					"lang": "de",
					"speaker": "Frank Appel",
					"speakerlink": "https://plus.google.com/113187713867352307061/posts",
					"abstract": "Das Entwickeln von JUnit Tests ist nicht so trivial, wie es auf den ersten Blick erscheinen mag. Ohne die nötige Sorgfalt erstellt, können Tests die Wartung und weitere Entwicklung einer Software stark behindern. Daher erklärt dieser Vortrag, wie man saubere und gut strukturierte Unit Tests schreibt, wie diese eine Unit von ihren Abhängigkeiten isolieren und so den Pflegeaufwand auch bei späteren Änderungsanforderungen minimieren.",
					"room": "Audimax"
				},
				{
					"title": "AIDE and Android Wear",
					"lang": "de",
					"speaker": "Dennis Strein",
					"speakerlink": "https://plus.google.com/+Android-IDE/posts",
					"abstract": "Develop Android Wear apps with AIDE, the on-device Android IDE. All you need is your Smartphone (or Tablet) with AIDE and a smartwatch to build the next Android Wear killer app.",
					"room": "A266"
				},
				{
					"title": "Google Play Game Services - Mobile Gaming made social",
					"lang": "de",
					"speaker": "Daniel Bälz",
					"speakerlink": "https://plus.google.com/+DanielB%C3%A4lz",
					"abstract": "Google Play Game Services bietet Spieleentwicklern interessante Funktionen für ihre Spiele. Dies umfasst unter anderem Achievements, Bestenlisten, Multiplayer-Unterstützung und das Speichern von Spielständen in der Cloud. Im Vortrag wird ein Überblick über diese Möglichkeiten gegeben und die Verwendung unter Android erläutert.",
					"room": "A268"
				}
			]
		},
		{
			"from": "14:00",
			"to": "14:45",
			"sessions": [
				{
					"title": "Automatische Testfallgenerierung oder \"Wie die Evolution den Affen zum Tester macht\"",
					"lang": "de",
					"speaker": "Dr. Jeremias Rößler",
					"speakerlink": "https://plus.google.com/u/0/113734370356119299787",
					"abstract": "Software-Fehler kosten die deutsche Wirtschaft bis zu 10 Mrd Euro im Jahr. Deshalb macht Testen derzeit ca. 20% der Kosten einer neuen Software aus, Tendenz steigen. Alleine für Java-Software sind das in Deutschland ca. 3,4 Mrd. Euro im Jahr. Diese Kosten entstehen hauptsächlich durch manuelles Testen bzw. manuelle Testfallerstellung. Der Automatisierungsgrad beim Testen liegt derzeit bei ca. 15%. An mehreren Beispielen aus der Praxis werden Möglichkeiten aufgezeigt automatisiertes Testen bzw. automatisierte Testfallerstellung zu nutzen, um sicherheitskritische Fehler zu finden.",
					"room": "Audimax"
				},
				{
					"title": "blukii - wearables, beacons, sensors & tags",
					"lang": "de",
					"speaker": "Matthias Schneider",
					"speakerlink": "http://www.blukii.com/de/",
					"abstract": "blukii is an open hardware platform containing wearables, beacons, sensors and tags. With its software libraries for the different operating systems, developers can easily create their own solutions based on the blukii hardware. The session will cover an overview of the different features of the blukii platform, also showing some demos.",
					"room": "A266"
				},
				{
					"title": "Optimization strategies for mobile game development",
					"lang": "en",
					"speaker": "Maya Posch",
					"speakerlink": "https://plus.google.com/+MayaPosch/posts",
					"abstract": "The approaches to optimization one can take to game development on a mobile platform like Android before, during and after development.The effect of certain implementations on overall performance.",
					"room": "A268"
				}
			]
		},
		{
			"from": "14:45",
			"to": "15:30",
			"sessions": [
				{
					"title": "Kaffeepause, Austausch-Plattform mit Speakern, etc. im Foyer"
				}
			]
		},
		{
			"from": "15:30",
			"to": "16:15",
			"sessions": [
				{
					"title": "Building Enterprise Application with AngularJS",
					"lang": "de",
					"speaker": "Christian Janz",
					"speakerlink": "https://plus.google.com/+ChristianJanz",
					"abstract": "Oft hört man die Aussage, dass man mit JavaScript keine professionellen Geschäftsanwendungen entwickeln kann. In dieser Session möchte ich versuchen, diese Aussage zu widerlegen. Hierzu werde ich zeigen, wie bewährte Konzepte, wie z.B. Continuous Integration, für eine AngularJS-Anwendung verwendet und umgesetzt werden können.",
					"room": "Audimax"
				},
				{
					"title": "Google Enterprise",
					"lang": "de",
					"speaker": "Clemens Düpmeier",
					"speakerlink": "https://plus.google.com/u/0/+ClemensD%C3%BCpmeier/posts",
					"abstract": "",
					"room": "A266"
				},
				{
					"title": "Kurzvorträge",
					"speaker": "",
					"speakerlink": "",
					"abstract": "Eine Reihe von 15 Minuten Vorträgen, Projektpräsentationen und mehr. Wenn du auch ein interessantes Thema hast und dieses gerne vortragen würdest, findest du das entsprechende Formular unter dem Programm. Sobald alle Plätze belegt sind, wird die Liste der Kurzvorträge hier veröffentlicht.",
					"room": "A268"
				}
			]
		},
		{
			"from": "16:15",
			"to": "17:00",
			"sessions": [
				{
					"title": "Polymer - Die Zukunft kann so süß sein",
					"lang": "de",
					"speaker": "Mitko Tschimev",
					"speakerlink": "https://plus.google.com/u/0/115359495435714348697/posts",
					"abstract": "Wir alle haben bereits von Web Components gehört. Doch was steckt wirklich dahinter und was hat es mit Polymer auf sich? Es wird auf die Techniken von Polymer eingegangen und wie weit diese bereits nutzbar sind. Die Kompatibilität ist natürlich auch ein ganz wichtiges Thema und darf nicht fehlen. Des weiteren wird der wichtige Aspekt Performance in diesem Bereich etwas genauer unter die Lupe genommen. ",
					"room": "Audimax"
				},
				{
					"title": "Advanced Building Blocks for your Geospatial Apps",
					"lang": "de",
					"speaker": "Eva Peters",
					"speakerlink": "https://www.linkedin.com/pub/eva-peters/94/469/9a4",
					"abstract": "Mobile devices are - by nature - designed for location-based apps and services. You can enrich your apps with geographic functionality such as geocoding, routing, mapping as well advanced geospatial analysis and real-time location-based messaging. Many developers make use of these diverse services that a handful geo-platforms expose through their APIs. There are no limits to the imagination for geo apps if we think apart from what standard APIs provide. What if the geographic service world would be highly customizable? You could build your own street network, use different attributes and algorithms for routing, use it mobile, online and offline. You could let people edit your maps, provide fine grained access and capabilities, and provide customized cartography. There are many more examples where using web and native geospatial building blocks for your applications is beneficial compared to only using standard platform services and functionalities. In this presentation, we will show you advanced and customized geospatial functionality beyond simple mapping and beyond standard services.",
					"room": "A266"
				},
				{
					"title": "Kurzvorträge",
					"speaker": "",
					"speakerlink": "",
					"abstract": "Eine Reihe von 15 Minuten Vorträgen, Projektpräsentationen und mehr. Wenn du auch ein interessantes Thema hast und dieses gerne vortragen würdest, findest du das entsprechende Formular unter dem Programm. Sobald alle Plätze belegt sind, wird die Liste der Kurzvorträge hier veröffentlicht.",
					"room": "A268"
				}
			]
		},
		{
			"from": "17:00",
			"to": "20:00",
			"sessions": [
				{
					"title": "DevFest After Work Party & Gameshow - meet the Organizers and Speakers",
					"speaker": "",
					"speakerlink": "",
					"abstract": "",
					"room": ""
				}
			]
		}
	]
}